{
  "Dashboard": {
    "title": "Spotify Playlist Builder",
    "description": "This site contains several methods to build recommendation playlists based on a user's playlists and preferences. Created playlists are public by default. This tool does not modify any existing playlists, it only reads playlists and creates new ones.",
    "links": {
      "title": "Pages",
      "fromPlaylist": {
        "name": "From Playlist",
        "description": "Create a playlist based on a user's previously created playlist."
      },
      "fromSong": {
        "name": "From Song",
        "description": "Create a playlist based on a user's previously created playlist with a focus on one specific song."
      },
      "fromGenre": {
        "name": "From Genre",
        "description": "Create a playlist based on a genre with the option to choose a playlist to base the recommendations on."
      },
      "fromArtist": {
        "name": "From Artist",
        "description": "Create a playlist based on an artist."
      },
      "statistics": {
        "name": "Statistics",
        "description": "View the genre distribution and music statistics of a playlist."
      },
      "dataOverview": {
        "name": "Data Overview",
        "description": "Summarize a user's complete Spotify listening history."
      }
    },
    "credits": {
      "title": "Credits",
      "spotify": {
        "name": "Spotify API",
        "url": "https://developer.spotify.com/",
        "description": "Thanks to Spotify for opening their API for users all around the world to use."
      },
      "everynoise": {
        "name": "Every Noise at Once",
        "url": "https://everynoise.com/",
        "description": "The genres in From Genres were taken from Every Noise at Once, because of the Spotify API's limited ability to display all genres."
      }
    }
  },
  "FromPlaylist": {
    "howToUse": {
      "title": "Create a playlist from a playlist",
      "description": "Select a playlist you which to create recommendations from. For each song in the playlist, it will generate recommendations. From all these recommendations, the top hundred most similar tracks to the songs in the playlist are chosen."
    }
  },
  "FromSong": {
    "howToUse": {
      "title": "Create a playlist from a song",
      "description1": "Select a playlist and then select a song you wish to create a playlist for. Use the options in the normal and advanced tab to specify which parameters you wish to use, and change them if you desire.",
      "description2": "This tool will create a recommendation list for every song in this playlist based on the selected options. It will then compare every found recommendation to the selected song, and choose the most top hundred most similar ones."
    },
    "warningNoneSelected": {
      "title": "Warning",
      "description": "No parameters enabled. Results will be less focused."
    }
  },
  "FromGenre": {
    "howToUse": {
      "title": "Create a playlist from a genre",
      "description1": "Select a genre in the first column for which you want to create a playlist for. The count in the genre is how many songs in all your playlists already have that genre. Additionally, you can set a playlist and the resulting tracks will be as similar to the playlist as possible.",
      "description2": "WARNING: The Spotify API is not very good for searching by genre, as most of the tracks are incompletely tagged. It's recommended to use other sources for properly searching by genre, such as <0>Every Noise at Once</0>. If a created playlist has no songs, it's highly likely the Spotify API could not find any songs matching the genre (even though an artist with the genre would exist)."
    }
  },
  "FromArtist": {
    "howToUse": {
      "title": "Create a playlist from an artist",
      "description": "Select a playlist and an artist in the second column. Based on the artist, a playlist of the top hundred most similar songs will be created."
    }
  },
  "Statistics": {
    "howToUse": {
      "title": "Playlist statistics",
      "description": "View the genres and statistics of a selected playlist, as provided by the Spotify API. The genres are the album and artist genres, and may not correctly reflect the song."
    }
  },
  "DataOverview": {
    "howToUse": {
      "title": "Overview of past listening history",
      "description1": "Enter the Spotify listening history data JSON files by pressing the '+' symbol in the left column. You can acquire this data by navigating to the <0>Spotify privacy settings page</0> and navigating to 'Extended streaming history'. Select the Extended streaming history checkbox and press Request Data. You should receive your data through mail within 30 days.",
      "description2": "WARNING: The amount of times listened is not completely accurate. Pausing a song and then continuing to play it counts as a separate listen, making it an unreliable value."
    }
  }
}
